verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/lucas/Dokumente/risa-payload-gatemate-risc-v/no/own_periphs/uart/UART.v
read_verilog /home/lucas/Dokumente/litex/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_Min.v
read_verilog /home/lucas/Dokumente/risa-payload-gatemate-risc-v/no/own_periphs/spi/spi_master.v
read_verilog /home/lucas/Dokumente/risa-payload-gatemate-risc-v/no/own_periphs/spi/spi_master_1.v
read_verilog /home/lucas/Dokumente/risa-payload-gatemate-risc-v/no/build/colognechip_gatemate_evb/gateware/colognechip_gatemate_evb.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_gatemate -nomx8  -top colognechip_gatemate_evb
write_verilog  colognechip_gatemate_evb_synth.v